name = input("Введите имя: ")
print('Привет,',name,'!')

number = int(input('Введи пожалуйста любое число: '))
print('А если прибавить к твоему числу двойку, то получим:', number + 2)

age = '18'
user_age = input('Сколько тебе лет? Введи число: ')
if user_age >= age:
    print('Доступ разрешен!')

else:
    print('Извини, пользование данным ресурсом только с 18 лет.')




 # Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран
 
 
# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.
 
 
# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
